In [1]:
people = {
    "first": ["Har", 'Jonny', 'Amit'], 
    "last": ["Mesh", 'Harode', 'Shukla'], 
    "email": ["harmesh@gmail.com", 'jonnyharode@email.com', 'amitshukla@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                  email
0    Har    Mesh      harmesh@gmail.com
1  Jonny  Harode  jonnyharode@email.com
2   Amit  Shukla   amitshukla@email.com

In [5]:
df['first'] + ' ' + df['last']

0        Har Mesh
1    Jonny Harode
2     Amit Shukla
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

   first    last                  email     full_name
0    Har    Mesh      harmesh@gmail.com      Har Mesh
1  Jonny  Harode  jonnyharode@email.com  Jonny Harode
2   Amit  Shukla   amitshukla@email.com   Amit Shukla

In [8]:
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                   email     full_name
0      harmesh@gmail.com      Har Mesh
1  jonnyharode@email.com  Jonny Harode
2   amitshukla@email.com   Amit Shukla

In [10]:
df['full_name'].str.split(' ', expand=True)

       0       1
0    Har    Mesh
1  Jonny  Harode
2   Amit  Shukla

In [11]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [12]:
df

                   email     full_name  first    last
0      harmesh@gmail.com      Har Mesh    Har    Mesh
1  jonnyharode@email.com  Jonny Harode  Jonny  Harode
2   amitshukla@email.com   Amit Shukla   Amit  Shukla

In [13]:
df.append({'first': 'mansi'}, ignore_index=True)

                   email     full_name  first    last
0      harmesh@gmail.com      Har Mesh    Har    Mesh
1  jonnyharode@email.com  Jonny Harode  Jonny  Harode
2   amitshukla@email.com   Amit Shukla   Amit  Shukla
3                    NaN           NaN  mansi     NaN

In [14]:
people = {
    'first': ['Naina', 'Rakesh'], 
    'last': ['Sharma', 'varma'], 
    'email': ['Naina@gmail.com', 'Rakesh@gmail.com']
}
df2 = pd.DataFrame(people)

In [15]:
df2

    first    last             email
0   Naina  Sharma   Naina@gmail.com
1  Rakesh   varma  Rakesh@gmail.com

In [16]:
df.append(df2, ignore_index=True, sort=False)

                   email     full_name   first    last
0      harmesh@gmail.com      Har Mesh     Har    Mesh
1  jonnyharode@email.com  Jonny Harode   Jonny  Harode
2   amitshukla@email.com   Amit Shukla    Amit  Shukla
3        Naina@gmail.com           NaN   Naina  Sharma
4       Rakesh@gmail.com           NaN  Rakesh   varma

In [17]:
df = df.append(df2, ignore_index=True, sort=False)

In [18]:
df

                   email     full_name   first    last
0      harmesh@gmail.com      Har Mesh     Har    Mesh
1  jonnyharode@email.com  Jonny Harode   Jonny  Harode
2   amitshukla@email.com   Amit Shukla    Amit  Shukla
3        Naina@gmail.com           NaN   Naina  Sharma
4       Rakesh@gmail.com           NaN  Rakesh   varma

In [19]:
df.drop(index=4)

                   email     full_name  first    last
0      harmesh@gmail.com      Har Mesh    Har    Mesh
1  jonnyharode@email.com  Jonny Harode  Jonny  Harode
2   amitshukla@email.com   Amit Shukla   Amit  Shukla
3        Naina@gmail.com           NaN  Naina  Sharma

In [20]:
df.drop(index=df[df['last'] == 'Shukla'].index)

                   email     full_name   first    last
0      harmesh@gmail.com      Har Mesh     Har    Mesh
1  jonnyharode@email.com  Jonny Harode   Jonny  Harode
3        Naina@gmail.com           NaN   Naina  Sharma
4       Rakesh@gmail.com           NaN  Rakesh   varma

In [21]:
filt = df['last'] == 'Shukla'
df.drop(index=df[filt].index)

                   email     full_name   first    last
0      harmesh@gmail.com      Har Mesh     Har    Mesh
1  jonnyharode@email.com  Jonny Harode   Jonny  Harode
3        Naina@gmail.com           NaN   Naina  Sharma
4       Rakesh@gmail.com           NaN  Rakesh   varma